programming/cpp/problem-solving.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>problem solving</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">problem solving</h1>
<pre class="example">
How to solve ANY problem pg24

- Identify the Class (or classes in the problem)
  - A good clue to identifying the class(es) in the problem is to
    underline all the nouns and then see which are the most useful to
    solve the problem
- What DATA needs to be stored in the Class(es)
- What DATA TYPE(s) are needed to represent this data
- What METHOD(s) should be performed by the class
- Make a first attempt at the Class definition(s)
- How is EACH method to be implemented (what's the algorithm or each method)
- How can these methods be used to solve the original problem ie what
  is the algorithm of main()
</pre>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
